In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({
    'name' : ['Alan','Alan','Alan','Alan','Alan','Jake','Charlie','Charlie'],
    'score' : [37,38,38,38,39,10,40,40]
})

df

      name  score
0     Alan     37
1     Alan     38
2     Alan     38
3     Alan     38
4     Alan     39
5     Jake     10
6  Charlie     40
7  Charlie     40

In [5]:
df.duplicated()

0    False
1    False
2     True
3     True
4    False
5    False
6    False
7     True
dtype: bool

In [8]:
df.duplicated().sum()

3

In [10]:
df.loc[df.duplicated(),:]

      name  score
2     Alan     38
3     Alan     38
7  Charlie     40

In [6]:
df.drop_duplicates()

      name  score
0     Alan     37
1     Alan     38
4     Alan     39
5     Jake     10
6  Charlie     40

In [7]:
df.drop_duplicates(['name'])

      name  score
0     Alan     37
5     Jake     10
6  Charlie     40

In [9]:
df.drop_duplicates(['name'], keep='last')

      name  score
4     Alan     39
5     Jake     10
7  Charlie     40